## <span style="color:#00bf63">**Fase 1**</span>
___
### <span >**1. An√°lisis Exploratorio de Datos (EDA) üîé**</span>
- **Importamos librer√≠as üìö y extendemos la visualizaci√≥n üíª**

In [2]:
import pandas as pd

# -----------------------------------------------------------------------

pd.set_option('display.max_columns', None) 
pd.set_option('display.max_colwidth', None)

In [3]:
# Funci√≥n para leer Dataset.
def leer_dataset(ruta1, ruta2, ruta3):
    df1 = pd.read_csv(ruta1)
    df2 = pd.read_csv(ruta2)
    df3 = pd.read_csv(ruta3)
    return df1, df2, df3

In [4]:
# LLamamos a la funci√≥n leer el Dataset.
ruta_clientes = "clientes.csv"
ruta_productos = "productos.csv"
ruta_ventas = "ventas.csv"

df_clientes, df_productos, df_ventas = leer_dataset(ruta_clientes,ruta_productos,ruta_ventas)

In [5]:
df_clientes.head(2)

  id_cliente nombre  apellido           ciudad
0      C0001  Julia     L√≥pez  Granada, Espa√±a
1      C0002  Elena  Mart√≠nez  Granada, Espa√±a

In [6]:
df_clientes.shape

(300, 4)

In [7]:
df_productos.head(4)

,id_producto,precio,categoria,descripcion
0,P0001,58.91 ‚Ç¨,Clothing,6GJFfPug1voQYH3zfXItpbjwRA7VVT64DGtG8VnRXaJJZ0SYJa
1,P0002,15.67 ‚Ç¨,Electronics,Ai3c6EdaRU5C0WuWl718dSYHakqGLiMJmpbVgn7iq6syGN3UJP
2,P0003,50.58 ‚Ç¨,Sports & Outdoors,yMidjq8PGxKEf6YFWfUKJN1sDhyIs2xareF0uaA4ngzUgmrDKc
3,P0004,72.88 ‚Ç¨,Sports & Outdoors,E8LBdxZItLULWZUyKPwzkjZJHD2GOSuqR7Od4DX5624ex1t5lN

In [8]:
df_productos.shape

(600, 4)

In [9]:
df_ventas.head(2)

  id_venta id_producto  cantidad       fecha id_cliente
0  V004849       P0173         4  2024-05-16      C0203
1  V003181       P0165         9  2022-09-12      C0004

In [10]:
df_ventas.shape

(80000, 5)

- **Exploramos los DataFrames**

In [11]:
def exploracion_dataframe(dataframe):
    print(f"Duplicados en el conjunto de datos: {dataframe.duplicated().sum()}")
    
    
    print("\n ..................... \n")


    # Generamos un DataFrame para los valores nulos
    print("Nulos en el conjunto de datos:")
    df_nulos_num = pd.DataFrame(dataframe.isnull().sum() / dataframe.shape[0] * 100, columns = ["%_nulos"])
    display(df_nulos_num[df_nulos_num["%_nulos"] > 0])
    

    # Nulos en columnas categ√≥ricas
    print("Nulos en columnas categ√≥ricas:")
    df_nulos_cat = pd.DataFrame(dataframe.select_dtypes(include="object").isnull().sum() / dataframe.shape[0] * 100, columns=["%_nulos"])
    display(df_nulos_cat[df_nulos_cat["%_nulos"] > 0])
    
    
    print("\n ..................... \n")
    

    print(f"Tipos de columnas:")
    display(pd.DataFrame(dataframe.dtypes, columns = ["tipo_dato"]))
    
    for col in dataframe.columns:
        print(f"Valores √∫nicos de la columna {col.upper()}:")
        display(pd.DataFrame(dataframe[col].value_counts()).head(12))

In [12]:
exploracion_dataframe(df_clientes)

Duplicados en el conjunto de datos: 0

 .....................

Nulos en el conjunto de datos:

Empty DataFrame
Columns: [%_nulos]
Index: []

Nulos en columnas categ√≥ricas:

Empty DataFrame
Columns: [%_nulos]
Index: []

 .....................

Tipos de columnas:

           tipo_dato
id_cliente    object
nombre        object
apellido      object
ciudad        object

Valores √∫nicos de la columna ID_CLIENTE:

            count
id_cliente
C0300           1
C0001           1
C0002           1
C0003           1
C0004           1
C0005           1
C0006           1
C0007           1
C0008           1
C0009           1
C0010           1
C0011           1

Valores √∫nicos de la columna NOMBRE:

        count
nombre
Mar√≠a      42
Ana        37
Marta      34
Sof√≠a      33
Elena      32
Luc√≠a      28
Laura      26
Carmen     25
Clara      23
Julia      20

Valores √∫nicos de la columna APELLIDO:

           count
apellido
Rodr√≠guez     38
L√≥pez         34
Garc√≠a        32
Fern√°ndez     31
Mart√≠nez      30
S√°nchez       29
P√©rez         29
Gonz√°lez      28
G√≥mez         26
Hern√°ndez     23

Valores √∫nicos de la columna CIUDAD:

                   count
ciudad
Lyon, Francia         24
Sevilla, Espa√±a       18
Marsella, Francia     18
Oporto, Portugal      17
M√°laga, Espa√±a        17
Toulouse, Francia     17
Bilbao, Espa√±a        17
Zaragoza, Espa√±a      17
Madrid, Espa√±a        16
Aveiro, Portugal      16
Co√≠mbra, Portugal     15
Murcia, Espa√±a        15

In [13]:
exploracion_dataframe(df_ventas)

Duplicados en el conjunto de datos: 80

 .....................

Nulos en el conjunto de datos:

Empty DataFrame
Columns: [%_nulos]
Index: []

Nulos en columnas categ√≥ricas:

Empty DataFrame
Columns: [%_nulos]
Index: []

 .....................

Tipos de columnas:

            tipo_dato
id_venta       object
id_producto    object
cantidad        int64
fecha          object
id_cliente     object

Valores √∫nicos de la columna ID_VENTA:

          count
id_venta
V005860      23
V002430      23
V004944      23
V000395      22
V007213      22
V003054      21
V000084      21
V006795      21
V003006      21
V005828      21
V005281      21
V005125      21

Valores √∫nicos de la columna ID_PRODUCTO:

             count
id_producto
P0057          209
P0269          209
P0193          202
P0026          199
P0410          197
P0068          197
P0456          196
P0021          196
P0044          195
P0338          194
P0448          193
P0367          193

Valores √∫nicos de la columna CANTIDAD:

          count
cantidad
9          8144
6          8106
4          8081
10         8045
1          8005
2          7972
3          7957
7          7937
5          7907
8          7846

Valores √∫nicos de la columna FECHA:

            count
fecha
2021-12-22    149
2022-12-04    140
2020-11-30    130
2023-09-20    127
2020-01-19    124
2023-07-22    124
2020-11-10    122
2022-12-03    121
2024-05-22    120
2020-10-10    118
2022-01-06    118
2020-08-19    118

Valores √∫nicos de la columna ID_CLIENTE:

            count
id_cliente
C0092         552
C0069         552
C0214         524
C0065         516
C0071         514
C0251         500
C0164         495
C0230         493
C0244         493
C0237         493
C0281         491
C0197         488

In [14]:
exploracion_dataframe(df_productos)

Duplicados en el conjunto de datos: 0

 .....................

Nulos en el conjunto de datos:

Empty DataFrame
Columns: [%_nulos]
Index: []

Nulos en columnas categ√≥ricas:

Empty DataFrame
Columns: [%_nulos]
Index: []

 .....................

Tipos de columnas:

            tipo_dato
id_producto    object
precio         object
categoria      object
descripcion    object

Valores √∫nicos de la columna ID_PRODUCTO:

             count
id_producto
P0600            1
P0001            1
P0002            1
P0003            1
P0004            1
P0005            1
P0006            1
P0007            1
P0008            1
P0009            1
P0010            1
P0011            1

Valores √∫nicos de la columna PRECIO:

         count
precio
58.91 ‚Ç¨      3
29.29 ‚Ç¨      2
83.70 ‚Ç¨      2
34.67 ‚Ç¨      2
85.45 ‚Ç¨      2
72.61 ‚Ç¨      2
43.80 ‚Ç¨      2
94.87 ‚Ç¨      2
36.65 ‚Ç¨      2
19.83 ‚Ç¨      2
69.00 ‚Ç¨      2
23.68 ‚Ç¨      2

Valores √∫nicos de la columna CATEGORIA:

                   count
categoria
Clothing             136
Sports & Outdoors    120
Books                120
Electronics          112
Home & Kitchen       112

Valores √∫nicos de la columna DESCRIPCION:

                                                    count
descripcion
MhSrwtkHwPKXGCwceiETSGg1hyFJAtb8GQ6kQoWECVJgZUM9sq      1
6GJFfPug1voQYH3zfXItpbjwRA7VVT64DGtG8VnRXaJJZ0SYJa      1
Ai3c6EdaRU5C0WuWl718dSYHakqGLiMJmpbVgn7iq6syGN3UJP      1
yMidjq8PGxKEf6YFWfUKJN1sDhyIs2xareF0uaA4ngzUgmrDKc      1
E8LBdxZItLULWZUyKPwzkjZJHD2GOSuqR7Od4DX5624ex1t5lN      1
zQLYUssRkFNu2GcCd8xBPrc5xiJH5DGQ66A0X4TFU0cHeazM6o      1
BWTEBnPofLlnlzXIs7YGgeCuEdkHaoAptjWkFF3K6fWFreSdkj      1
wRY7bHnZGHvTI0Wohm402P4HiSvNdT6rlMn3yPP5t2eYEUfYXD      1
BwMy4M0Yd7xVeG9VBApK2M5w0jZNBBUxdDBmNI7wMl05DFzgyF      1
ZYe56DXTf6Sq3LYpZM1aWlmrV3IBFsGccHDrvKknWrLigT7s7f      1
DOCqX8LOw4BTNdjymZDf6pnZVYsVY4UwoUmOpEmAZYCijM4UJf      1
tHlni48qZJ6w17vjViy3vKpPaWRwMrM2DG8QOFCF9ePv7AC1jv      1

- **Cambios df_clientes**

In [15]:
# Separamos la columna 'ciudad' en dos columnas: 'ciudad' y 'pais'
df_clientes[['ciudad', 'pais']] = df_clientes['ciudad'].str.split(', ', expand=True)

- **Comprobaciones df_clientes‚úÖ**

In [16]:
df_clientes.head(10)

  id_cliente  nombre   apellido    ciudad      pais
0      C0001   Julia      L√≥pez   Granada    Espa√±a
1      C0002   Elena   Mart√≠nez   Granada    Espa√±a
2      C0003   Laura    S√°nchez      Lyon   Francia
3      C0004   Marta      L√≥pez  Valencia    Espa√±a
4      C0005     Ana   Mart√≠nez     Par√≠s   Francia
5      C0006   Elena      L√≥pez     Braga  Portugal
6      C0007   Laura   Gonz√°lez  Zaragoza    Espa√±a
7      C0008   Marta      L√≥pez   Sevilla    Espa√±a
8      C0009     Ana  Hern√°ndez   Sevilla    Espa√±a
9      C0010  Carmen      L√≥pez   Granada    Espa√±a

- **Cambios df_ventas**

In [17]:
# Cambiamos de tipo de dato de la columna "fecha" de object a fecha.
df_ventas['fecha'] = pd.to_datetime(df_ventas['fecha'], format='%Y-%m-%d')

- **Comprobaciones df_ventas‚úÖ**

In [18]:
df_ventas.head(10)

  id_venta id_producto  cantidad      fecha id_cliente
0  V004849       P0173         4 2024-05-16      C0203
1  V003181       P0165         9 2022-09-12      C0004
2  V000311       P0194        10 2020-12-02      C0156
3  V002787       P0167         1 2023-07-22      C0058
4  V002726       P0417        10 2022-04-10      C0099
5  V003374       P0484         3 2022-11-11      C0039
6  V007378       P0394         4 2024-03-15      C0150
7  V005799       P0024         4 2023-11-01      C0244
8  V001810       P0449         6 2022-12-01      C0032
9  V005219       P0269        10 2021-09-04      C0229

In [19]:
df_ventas["fecha"].dtype

dtype('<M8[ns]')

El resultado dtype('<M8[ns]') indica que los valores en la columna "fecha" son de tipo datetime64[ns], lo cual significa que son fechas y horas representadas a nivel de nanosegundos.

- **Cambios df_productos**

In [20]:
# Reemplazamos el s√≠mbolo del euro y cambiamos de tipo de dato de la columna "precio" de object a float.

def quitar_metacaracteres(dataframe, columna):
    # Funci√≥n para reemplazar el s√≠mbolo del euro y cualquier espacio adicional por una cadena vac√≠a.
    dataframe[columna] = dataframe[columna].str.replace('‚Ç¨', '', regex=True).str.strip()
    return dataframe

def obj_float(dataframe, columna):
    # Funci√≥n para convertir el tipo de dato de obj a float.
    dataframe[columna] = dataframe[columna].astype(float)
    return dataframe

In [21]:
# Ejecutamos la primera funci√≥n. 
df_productos = quitar_metacaracteres(df_productos, "precio")

In [22]:
# Ejecutamos la segunda funci√≥n:
df_productos = obj_float(df_productos, "precio")

- **Comprobaciones df_productos‚úÖ**

In [23]:
df_productos.head(10)

,id_producto,precio,categoria,descripcion
0,P0001,58.91,Clothing,6GJFfPug1voQYH3zfXItpbjwRA7VVT64DGtG8VnRXaJJZ0SYJa
1,P0002,15.67,Electronics,Ai3c6EdaRU5C0WuWl718dSYHakqGLiMJmpbVgn7iq6syGN3UJP
2,P0003,50.58,Sports & Outdoors,yMidjq8PGxKEf6YFWfUKJN1sDhyIs2xareF0uaA4ngzUgmrDKc
3,P0004,72.88,Sports & Outdoors,E8LBdxZItLULWZUyKPwzkjZJHD2GOSuqR7Od4DX5624ex1t5lN
4,P0005,70.23,Books,zQLYUssRkFNu2GcCd8xBPrc5xiJH5DGQ66A0X4TFU0cHeazM6o
5,P0006,38.15,Home & Kitchen,BWTEBnPofLlnlzXIs7YGgeCuEdkHaoAptjWkFF3K6fWFreSdkj
6,P0007,29.46,Books,wRY7bHnZGHvTI0Wohm402P4HiSvNdT6rlMn3yPP5t2eYEUfYXD
7,P0008,84.19,Clothing,BwMy4M0Yd7xVeG9VBApK2M5w0jZNBBUxdDBmNI7wMl05DFzgyF
8,P0009,22.99,Books,ZYe56DXTf6Sq3LYpZM1aWlmrV3IBFsGccHDrvKknWrLigT7s7f
9,P0010,32.40,Books,DOCqX8LOw4BTNdjymZDf6pnZVYsVY4UwoUmOpEmAZYCijM4UJf

In [24]:
df_productos["precio"].dtype

dtype('float64')

### <span >**2. Guardamos los csv üóÇÔ∏è**</span>

In [25]:
# Guardamos los DataFrames transformados en archivos CSV.
df_clientes.to_csv("clientes2.csv", index=False)
df_ventas.to_csv("ventas2.csv", index=False)
df_productos.to_csv("productos2.csv", index=False)